In [1]:
import pandas as pd

In [12]:
data_df = pd.read_csv('./source/Dataset/cardio_data.csv')

In [13]:
data_df.head()

,date,country,id,active,age,alco,ap_hi,ap_lo,cholesterol,gender,gluc,height,occupation,smoke,weight,disease
0,03-05-2021,Indonesia,0,1,18393,0,110,80,1,2,1,168,Architect,0,62.0,0
1,05-08-2021,Malaysia,1,1,20228,0,140,90,3,1,1,156,Accountant,0,85.0,1
2,13-11-2022,Indonesia,2,0,18857,0,130,70,3,1,1,165,Chef,0,64.0,1
3,31-10-2018,Singapore,3,1,17623,0,150,100,1,2,1,169,Lawyer,0,82.0,1
4,25-09-2020,Singapore,4,0,17474,0,100,60,1,1,1,156,Architect,0,56.0,0

In [14]:
len(data_df)

70000

In [15]:
print(data_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70000 entries, 0 to 69999
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         70000 non-null  object
 1   country      70000 non-null  object
 2   id           70000 non-null  int64
 3   active       70000 non-null  int64
 4   age          70000 non-null  int64
 5   alco         70000 non-null  int64
 6   ap_hi        70000 non-null  int64
 7   ap_lo        70000 non-null  int64
 8   cholesterol  70000 non-null  int64
 9   gender       70000 non-null  int64
 10  gluc         70000 non-null  int64
 11  height       70000 non-null  int64
 12  occupation   70000 non-null  object
 13  smoke        70000 non-null  int64
 14  weight       70000 non-null  float64
 15  disease      70000 non-null  int64
dtypes: float64(1), int64(12), object(3)
memory usage: 8.5+ MB
None

In [16]:
for column in data.columns:
    unique_values = data[column].unique()
    print(f"Unique values for column '{column}': {unique_values}")

Unique values for column 'date': ['03-05-2021' '05-08-2021' '13-11-2022' ... '23-01-2020' '09-02-2018'
 '07-11-2021']
Unique values for column 'country': ['Indonesia' 'Malaysia' 'Singapore' 'India']
Unique values for column 'id': [    0     1     2 ... 99996 99998 99999]
Unique values for column 'active': [1 0]
Unique values for column 'age': [18393 20228 18857 ... 14925 17727 17926]
Unique values for column 'alco': [0 1]
Unique values for column 'ap_hi': [  110   140   130   150   100   120   145   170   135   125    90   180
   160   133   190    80   122   169   126   158   200    14   123    70
   161   147   115   137   153    11   148   105   220   119   141   165
   164    12   124   172   902   162   906   117   134   166   210   176
   116    10   121    16   112   159   113   118   155   142   131   157
   136   146   138  -100   909   109    85   106   129    93     7    95
   179   156   168   132   104   103   178   175   128   151    15   139
 11500   127    17   108   144   102     1  1420    13   143   701   107
   184   149   167   114   101    60  1500   181   171   202  -115   111
   907    20   188   185   163   173   154   177  -140   174  -120 14020
  1400   240   191   197  1620   152    96   199  -150  1130   193    99
   196   309   401 16020  1202   806  1300   230   207   215    97  1409
 11020    24   960 13010  1110   195  1205   187  2000]
Unique values for column 'ap_lo': [   80    90    70   100    60    85    89   110    65    63    79  1100
  1000   800   120    50    30   109    84  1033   150    91    40    73
    78    75    86    87  1001    82    95    69    74    97    81  1200
    83   119     0    93   105 10000    99    77    59  8044   140    92
  1044   108   125   115    68    61   106   102    94    66    52   170
    76   160    62    96   130   113    67  9100    10    88   902     8
   112   104    71    72  1008    98  2088    20   802  8000  1022   850
   708    57   101  9011  1011    64  1007  1177  7100    45   709  8500
    58  1110  8099  1088   126  1077  1120     7   103  1125   180   121
  8100   710  5700  8079  1111  1003     6  1900   809   114   801  1002
    53   111     1   118    56   182   810     9  7099 11000  9800  8200
  1139   107   820    55  1400   190   900   122  6800   135   700    15
  1101   910  1140  1211   -70    54  8077   901   880   870   585    49
   602]
Unique values for column 'cholesterol': [1 3 2]
Unique values for column 'gender': [2 1]
Unique values for column 'gluc': [1 2 3]
Unique values for column 'height': [168 156 165 169 151 157 178 158 164 173 181 172 170 154 162 163 153 159
 166 155 160 175 171 152 187 148 179 180 188 185 167 183 174 176 161 184
 177 182  76 149 142 150 144 147 186 146 141 195 140 198 145 143 196 138
 194 190 134 136 100 120 189 137 192 122 250 191 117  70  97 119 130 110
 193  75 132  71 135  67 125 139 133  74  98 112 207  68  55  81  80  64
  91  60 109  72 197  65 128 105 108 200 104 111 113  96 131  59  66  99
  57]
Unique values for column 'occupation': ['Architect' 'Accountant' 'Chef' 'Lawyer' 'Teacher' 'Nurse' 'Engineer'
 'Doctor' 'Others']
Unique values for column 'smoke': [0 1]
Unique values for column 'weight': [ 62.    85.    64.    82.    56.    67.    93.    95.    71.    68.
  80.    60.    78.   112.    75.    52.    83.    69.    90.    45.
  65.    59.    66.    74.   105.    73.    55.    70.    72.    63.
  50.   107.    84.    77.    79.    76.    58.   115.    97.    53.
  57.    49.   110.    94.    92.    87.   103.    88.    99.   100.
  61.    48.    54.    51.    47.    91.   104.    81.    98.   108.
  89.   101.    86.    65.5  142.    96.    44.    41.   169.   116.
 200.    64.8  120.   117.   125.   106.   114.   113.   129.   124.
  42.   123.   111.   102.   109.    46.   139.   150.   138.   131.
  43.    83.6  134.   106.5  121.    40.   141.   119.   126.   177.
 165.   122.    62.3  118.    89.5  132.   155.   130.   159.    84.6
 140.    82.3   30.    67.9  127.    67.5   74.3  149.   180.   128.
  60.2   64.5   58.7   90.5   37.    80.8  166.   161.    92.2   75.6
 136.    82.9  154.    68.9  170.    84.5  135.    72.5  146.    70.5
  74.2   84.3   38.    54.5  145.    68.5   79.5   72.8   73.2   96.5
  53.2   39.    61.2  168.   133.    54.35  50.7   79.94  45.8  153.
  34.    62.4  167.   156.    35.    70.3   31.    60.5   69.8   64.7
  64.1  152.    59.5  163.    75.5   78.2  162.   121.3  178.    82.5
  90.7   80.6   55.6   59.8   74.77  32.    70.8   57.4   73.8   56.2
  69.5   71.5   89.1  158.    76.5   35.45  86.5   63.8   23.   144.
  70.2   68.4  148.   164.    22.    66.5   54.9   59.2   65.3  137.
  62.2   50.5   36.    61.5   80.5   81.1   53.6   11.    66.4   76.7
  28.    68.3   60.6   76.8   58.8  181.    75.2   83.5   64.3  175.
  84.9   80.7   84.7   60.1  105.5   85.5  121.8   51.5   53.9   42.2
  74.5  114.6   73.5   71.3   33.    66.3   53.3   67.8   70.7   52.3
  82.4   63.4   71.2   62.5   63.82  88.5   89.9   72.1  106.4  160.
  68.2   53.67 171.    55.2   94.5  143.    62.7   53.5  109.5   10.
  82.1   57.8   84.8   21.    29.   183.    58.5   57.6   78.5  172.
 109.7   61.3   67.3   94.7  147.    55.4   99.9 ]
Unique values for column 'disease': [0 1]

In [25]:
data_df['age_years'] = data_df['age'] / 365
data_df['age_years'] = data_df['age_years'].astype(int)
data_df.drop(columns=['age'])

,date,country,id,active,alco,ap_hi,ap_lo,cholesterol,gender,gluc,height,occupation,smoke,weight,disease,age_years
0,03-05-2021,Indonesia,0,1,0,110,80,1,2,1,168,Architect,0,62.0,0,50
1,05-08-2021,Malaysia,1,1,0,140,90,3,1,1,156,Accountant,0,85.0,1,55
2,13-11-2022,Indonesia,2,0,0,130,70,3,1,1,165,Chef,0,64.0,1,51
3,31-10-2018,Singapore,3,1,0,150,100,1,2,1,169,Lawyer,0,82.0,1,48
4,25-09-2020,Singapore,4,0,0,100,60,1,1,1,156,Architect,0,56.0,0,47
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
69995,03-04-2018,Singapore,99993,1,0,120,80,1,2,1,168,Doctor,1,76.0,0,52
69996,12-01-2022,Malaysia,99995,1,0,140,90,2,1,2,158,Accountant,0,126.0,1,61
69997,25-08-2022,Malaysia,99996,0,1,180,90,3,2,1,183,Accountant,0,105.0,1,52
69998,13-07-2020,Singapore,99998,0,0,135,80,1,1,2,163,Accountant,0,72.0,1,61
69999,15-01-2018,Singapore,99999,1,0,120,80,2,1,1,170,Teacher,0,72.0,0,56

In [23]:
data_df

,date,country,id,active,age,alco,ap_hi,ap_lo,cholesterol,gender,gluc,height,occupation,smoke,weight,disease,age_years
0,03-05-2021,Indonesia,0,1,18393,0,110,80,1,2,1,168,Architect,0,62.0,0,50
1,05-08-2021,Malaysia,1,1,20228,0,140,90,3,1,1,156,Accountant,0,85.0,1,55
2,13-11-2022,Indonesia,2,0,18857,0,130,70,3,1,1,165,Chef,0,64.0,1,51
3,31-10-2018,Singapore,3,1,17623,0,150,100,1,2,1,169,Lawyer,0,82.0,1,48
4,25-09-2020,Singapore,4,0,17474,0,100,60,1,1,1,156,Architect,0,56.0,0,47
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
69995,03-04-2018,Singapore,99993,1,19240,0,120,80,1,2,1,168,Doctor,1,76.0,0,52
69996,12-01-2022,Malaysia,99995,1,22601,0,140,90,2,1,2,158,Accountant,0,126.0,1,61
69997,25-08-2022,Malaysia,99996,0,19066,1,180,90,3,2,1,183,Accountant,0,105.0,1,52
69998,13-07-2020,Singapore,99998,0,22431,0,135,80,1,1,2,163,Accountant,0,72.0,1,61
69999,15-01-2018,Singapore,99999,1,20540,0,120,80,2,1,1,170,Teacher,0,72.0,0,56